-- MySQL dump 10.13  Distrib 8.0.33, for Win64 (x86_64)
--
-- Host: 127.0.0.1    Database: cabdsp
-- ------------------------------------------------------
-- Server version	8.0.32

/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!50503 SET NAMES utf8 */;
/*!40103 SET @OLD_TIME_ZONE=@@TIME_ZONE */;
/*!40103 SET TIME_ZONE='+00:00' */;
/*!40014 SET @OLD_UNIQUE_CHECKS=@@UNIQUE_CHECKS, UNIQUE_CHECKS=0 */;
/*!40014 SET @OLD_FOREIGN_KEY_CHECKS=@@FOREIGN_KEY_CHECKS, FOREIGN_KEY_CHECKS=0 */;
/*!40101 SET @OLD_SQL_MODE=@@SQL_MODE, SQL_MODE='NO_AUTO_VALUE_ON_ZERO' */;
/*!40111 SET @OLD_SQL_NOTES=@@SQL_NOTES, SQL_NOTES=0 */;

--
-- Table structure for table `direct`
--

DROP TABLE IF EXISTS `direct`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `direct` (
  `directID` int NOT NULL AUTO_INCREMENT,
  `directName` varchar(45) NOT NULL,
  PRIMARY KEY (`directID`)
) ENGINE=InnoDB AUTO_INCREMENT=158 DEFAULT CHARSET=utf8mb3;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `direct`
--

LOCK TABLES `direct` WRITE;
/*!40000 ALTER TABLE `direct` DISABLE KEYS */;
INSERT INTO `direct` VALUES (1,'市场营销'),(2,'经济'),(3,'外贸'),(4,'商务'),(5,'律师'),(6,'法务'),(7,'司法'),(8,'专利'),(9,'人力资源'),(10,'政策分析'),(11,'社会工作'),(12,'金融'),(13,'统计'),(14,'数据分析'),(15,'数学教育'),(16,'光学'),(17,'电子'),(18,'声学'),(19,'物理教育'),(20,'结构工程'),(21,'机械工程'),(22,'土木工程'),(23,'材料工程'),(24,'机械制造'),(25,'机械设计'),(26,'设备治理'),(27,'材料研发'),(28,'质量控制'),(29,'材料制造'),(30,'材料测试'),(31,'新能源'),(32,'储能'),(33,'燃料电池'),(34,'动力系统'),(35,'电气能源'),(36,'电路设计'),(37,'电气控制'),(38,'电力系统'),(39,'电子产品'),(40,'集成电路设计'),(41,'半导体工艺'),(42,'光电子'),(43,'通信'),(44,'信号处理'),(45,'软件开发'),(46,'机器人'),(47,'智能制造'),(48,'自动控制'),(49,'人工智能'),(50,'人工智能'),(51,'网络安全'),(52,'大数据'),(53,'软件开发'),(54,'财务分析'),(55,'企业运营'),(56,'市场管理'),(57,'投资'),(58,'财务分析'),(59,'精算'),(60,'前端开发'),(61,'后端开发'),(62,'软件测试'),(63,'软件架构'),(64,'税务'),(65,'财务分析'),(66,'秘书'),(67,'会计师'),(68,'芯片设计'),(69,'光电子'),(70,'半导体工艺'),(71,'电路设计'),(72,'汽车设计与制造'),(73,'汽车电子与控制'),(74,'汽车动力系统'),(75,'汽车安全工程'),(76,'化工过程装备'),(77,'化工过程控制'),(78,'化工安全工程'),(79,'化工材料'),(80,'核反应堆工程'),(81,'核燃料循环与材料'),(82,'核技术应用'),(83,'核安全与辐射防护'),(84,'医学影像与信号处理'),(85,'生物传感与仪器'),(86,'生物材料与组织工程'),(87,'医疗设备与技术'),(88,'内科学'),(89,'外科学'),(90,'儿科学'),(91,'妇产科学'),(92,'生产系统工程'),(93,'供应链管理'),(94,'质量工程'),(95,'人因工程'),(96,'计算机科学'),(97,'信息科学'),(98,'计算机网络'),(99,'数据科学'),(100,'政治理论'),(101,'思想道德修养'),(102,'教育学'),(103,'心理学'),(104,'有机化学'),(105,'无机化学'),(106,'分析化学'),(107,'材料化学'),(108,'统计方法与应用'),(109,'统计推断'),(110,'统计计算'),(111,'数据挖掘'),(112,'材料结构与性能'),(113,'材料表征与测试'),(114,'材料模拟与计算'),(115,'材料物理化学'),(116,'可再生能源'),(117,'能源转换与储存'),(118,'能源管理与政策'),(119,'能源系统分析'),(120,'飞行器结构与材料'),(121,'飞行器动力学与控制'),(122,'飞行器设计与制造'),(123,'航空航天技术'),(124,'口腔疾病诊断与治疗'),(125,'口腔颌面外科'),(126,'口腔修复与正畸'),(127,'口腔预防保健'),(128,'流行病学'),(129,'卫生统计学'),(130,'环境卫生学'),(131,'健康教育与促进'),(132,'法医病理学'),(133,'法医毒理学'),(134,'法医临床学'),(135,'法医学鉴定学'),(136,'劳动经济学'),(137,'劳动法学'),(138,'社会保障制度'),(139,'劳动关系管理'),(140,'财政理论与政策'),(141,'财政管理'),(142,'税收理论与实务'),(143,'公共财政'),(144,'国际贸易理论与政策'),(145,'国际经济合作'),(146,'国际金融'),(147,'国际商务'),(148,'电子商务模式与应用'),(149,'电子商务技术'),(150,'电子支付与安全'),(151,'电子商务战略');
/*!40000 ALTER TABLE `direct` ENABLE KEYS */;
UNLOCK TABLES;
/*!40103 SET TIME_ZONE=@OLD_TIME_ZONE */;

/*!40101 SET SQL_MODE=@OLD_SQL_MODE */;
/*!40014 SET FOREIGN_KEY_CHECKS=@OLD_FOREIGN_KEY_CHECKS */;
/*!40014 SET UNIQUE_CHECKS=@OLD_UNIQUE_CHECKS */;
/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
/*!40111 SET SQL_NOTES=@OLD_SQL_NOTES */;

-- Dump completed on 2024-04-23 15:35:50
