-- MySQL dump 10.13  Distrib 8.0.33, for Win64 (x86_64)
--
-- Host: 127.0.0.1    Database: cabdsp
-- ------------------------------------------------------
-- Server version	8.0.32

/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!50503 SET NAMES utf8 */;
/*!40103 SET @OLD_TIME_ZONE=@@TIME_ZONE */;
/*!40103 SET TIME_ZONE='+00:00' */;
/*!40014 SET @OLD_UNIQUE_CHECKS=@@UNIQUE_CHECKS, UNIQUE_CHECKS=0 */;
/*!40014 SET @OLD_FOREIGN_KEY_CHECKS=@@FOREIGN_KEY_CHECKS, FOREIGN_KEY_CHECKS=0 */;
/*!40101 SET @OLD_SQL_MODE=@@SQL_MODE, SQL_MODE='NO_AUTO_VALUE_ON_ZERO' */;
/*!40111 SET @OLD_SQL_NOTES=@@SQL_NOTES, SQL_NOTES=0 */;

--
-- Table structure for table `location`
--

DROP TABLE IF EXISTS `location`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `location` (
  `locationID` int NOT NULL AUTO_INCREMENT,
  `city` varchar(45) NOT NULL,
  `province` varchar(45) NOT NULL,
  PRIMARY KEY (`locationID`)
) ENGINE=InnoDB AUTO_INCREMENT=370 DEFAULT CHARSET=utf8mb3;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `location`
--

LOCK TABLES `location` WRITE;
/*!40000 ALTER TABLE `location` DISABLE KEYS */;
INSERT INTO `location` VALUES (1,'石家庄','河北省'),(2,'唐山','河北省'),(3,'秦皇岛','河北省'),(4,'邯郸','河北省'),(5,'邢台','河北省'),(6,'保定','河北省'),(7,'张家口','河北省'),(8,'承德','河北省'),(9,'沧州','河北省'),(10,'廊坊','河北省'),(11,'衡水','河北省'),(12,'太原','山西省'),(13,'大同','山西省'),(14,'阳泉','山西省'),(15,'长治','山西省'),(16,'晋城','山西省'),(17,'朔州','山西省'),(18,'晋中','山西省'),(19,'运城','山西省'),(20,'忻州','山西省'),(21,'临汾','山西省'),(22,'吕梁','山西省'),(23,'沈阳','辽宁省'),(24,'大连','辽宁省'),(25,'鞍山','辽宁省'),(26,'抚顺','辽宁省'),(27,'本溪','辽宁省'),(28,'丹东','辽宁省'),(29,'锦州','辽宁省'),(30,'营口','辽宁省'),(31,'阜新','辽宁省'),(32,'辽阳','辽宁省'),(33,'盘锦','辽宁省'),(34,'铁岭','辽宁省'),(35,'朝阳','辽宁省'),(36,'葫芦岛','辽宁省'),(37,'长春','吉林省'),(38,'吉林','吉林省'),(39,'四平','吉林省'),(40,'辽源','吉林省'),(41,'通化','吉林省'),(42,'白山','吉林省'),(43,'松原','吉林省'),(44,'白城','吉林省'),(45,'延边朝鲜族自治州','吉林省'),(46,'哈尔滨','黑龙江省'),(47,'齐齐哈尔','黑龙江省'),(48,'鸡西','黑龙江省'),(49,'鹤岗','黑龙江省'),(50,'双鸭山','黑龙江省'),(51,'大庆','黑龙江省'),(52,'伊春','黑龙江省'),(53,'佳木斯','黑龙江省'),(54,'七台河','黑龙江省'),(55,'牡丹江','黑龙江省'),(56,'黑河','黑龙江省'),(57,'绥化','黑龙江省'),(58,'大兴安岭地区','黑龙江省'),(59,'南京','江苏省'),(60,'无锡','江苏省'),(61,'徐州','江苏省'),(62,'常州','江苏省'),(63,'苏州','江苏省'),(64,'南通','江苏省'),(65,'连云港','江苏省'),(66,'淮安','江苏省'),(67,'盐城','江苏省'),(68,'扬州','江苏省'),(69,'镇江','江苏省'),(70,'泰州','江苏省'),(71,'宿迁','江苏省'),(72,'杭州','浙江省'),(73,'宁波','浙江省'),(74,'温州','浙江省'),(75,'嘉兴','浙江省'),(76,'湖州','浙江省'),(77,'绍兴','浙江省'),(78,'金华','浙江省'),(79,'衢州','浙江省'),(80,'舟山','浙江省'),(81,'台州','浙江省'),(82,'丽水','浙江省'),(83,'合肥','安徽省'),(84,'芜湖','安徽省'),(85,'蚌埠','安徽省'),(86,'淮南','安徽省'),(87,'马鞍山','安徽省'),(88,'淮北','安徽省'),(89,'铜陵','安徽省'),(90,'安庆','安徽省'),(91,'黄山','安徽省'),(92,'滁州','安徽省'),(93,'阜阳','安徽省'),(94,'宿州','安徽省'),(95,'六安','安徽省'),(96,'亳州','安徽省'),(97,'池州','安徽省'),(98,'宣城','安徽省'),(99,'福州','福建省'),(100,'厦门','福建省'),(101,'莆田','福建省'),(102,'三明','福建省'),(103,'泉州','福建省'),(104,'漳州','福建省'),(105,'南平','福建省'),(106,'龙岩','福建省'),(107,'宁德','福建省'),(108,'南昌','江西省'),(109,'景德镇','江西省'),(110,'萍乡','江西省'),(111,'九江','江西省'),(112,'新余','江西省'),(113,'鹰潭','江西省'),(114,'赣州','江西省'),(115,'吉安','江西省'),(116,'宜春','江西省'),(117,'抚州','江西省'),(118,'上饶','江西省'),(119,'济南','山东省'),(120,'青岛','山东省'),(121,'淄博','山东省'),(122,'枣庄','山东省'),(123,'东营','山东省'),(124,'烟台','山东省'),(125,'潍坊','山东省'),(126,'济宁','山东省'),(127,'泰安','山东省'),(128,'威海','山东省'),(129,'日照','山东省'),(130,'莱芜','山东省'),(131,'临沂','山东省'),(132,'德州','山东省'),(133,'聊城','山东省'),(134,'滨州','山东省'),(135,'菏泽','山东省'),(136,'郑州','河南省'),(137,'开封','河南省'),(138,'洛阳','河南省'),(139,'平顶山','河南省'),(140,'安阳','河南省'),(141,'鹤壁','河南省'),(142,'新乡','河南省'),(143,'焦作','河南省'),(144,'濮阳','河南省'),(145,'许昌','河南省'),(146,'漯河','河南省'),(147,'三门峡','河南省'),(148,'南阳','河南省'),(149,'商丘','河南省'),(150,'信阳','河南省'),(151,'周口','河南省'),(152,'驻马店','河南省'),(153,'济源','河南省'),(154,'武汉','湖北省'),(155,'黄石','湖北省'),(156,'十堰','湖北省'),(157,'宜昌','湖北省'),(158,'襄阳','湖北省'),(159,'鄂州','湖北省'),(160,'荆门','湖北省'),(161,'孝感','湖北省'),(162,'荆州','湖北省'),(163,'黄冈','湖北省'),(164,'咸宁','湖北省'),(165,'随州','湖北省'),(166,'恩施土家族苗族自治州','湖北省'),(167,'仙桃','湖北省'),(168,'潜江','湖北省'),(169,'天门','湖北省'),(170,'神农架林区','湖北省'),(171,'长沙','湖南省'),(172,'株洲','湖南省'),(173,'湘潭','湖南省'),(174,'衡阳','湖南省'),(175,'邵阳','湖南省'),(176,'岳阳','湖南省'),(177,'常德','湖南省'),(178,'张家界','湖南省'),(179,'益阳','湖南省'),(180,'郴州','湖南省'),(181,'永州','湖南省'),(182,'怀化','湖南省'),(183,'娄底','湖南省'),(184,'湘西土家族苗族自治州','湖南省'),(185,'广州','广东省'),(186,'韶关','广东省'),(187,'深圳','广东省'),(188,'珠海','广东省'),(189,'汕头','广东省'),(190,'佛山','广东省'),(191,'江门','广东省'),(192,'湛江','广东省'),(193,'茂名','广东省'),(194,'肇庆','广东省'),(195,'惠州','广东省'),(196,'梅州','广东省'),(197,'汕尾','广东省'),(198,'河源','广东省'),(199,'阳江','广东省'),(200,'清远','广东省'),(201,'东莞','广东省'),(202,'中山','广东省'),(203,'潮州','广东省'),(204,'揭阳','广东省'),(205,'云浮','广东省'),(206,'海口','海南省'),(207,'三亚','海南省'),(208,'三沙','海南省'),(209,'儋州','海南省'),(210,'五指山','海南省'),(211,'琼海','海南省'),(212,'文昌','海南省'),(213,'万宁','海南省'),(214,'东方','海南省'),(215,'成都','四川省'),(216,'自贡','四川省'),(217,'攀枝花','四川省'),(218,'泸州','四川省'),(219,'德阳','四川省'),(220,'绵阳','四川省'),(221,'广元','四川省'),(222,'遂宁','四川省'),(223,'内江','四川省'),(224,'乐山','四川省'),(225,'南充','四川省'),(226,'眉山','四川省'),(227,'宜宾','四川省'),(228,'广安','四川省'),(229,'达州','四川省'),(230,'雅安','四川省'),(231,'巴中','四川省'),(232,'资阳','四川省'),(233,'阿坝藏族羌族自治州','四川省'),(234,'甘孜藏族自治州','四川省'),(235,'凉山彝族自治州','四川省'),(236,'贵阳','贵州省'),(237,'六盘水','贵州省'),(238,'遵义','贵州省'),(239,'安顺','贵州省'),(240,'毕节','贵州省'),(241,'铜仁','贵州省'),(242,'黔西南布依族苗族自治州','贵州省'),(243,'黔东南苗族侗族自治州','贵州省'),(244,'黔南布依族苗族自治州','贵州省'),(245,'昆明','云南省'),(246,'曲靖','云南省'),(247,'玉溪','云南省'),(248,'保山','云南省'),(249,'昭通','云南省'),(250,'丽江','云南省'),(251,'普洱','云南省'),(252,'临沧','云南省'),(253,'楚雄彝族自治州','云南省'),(254,'红河哈尼族彝族自治州','云南省'),(255,'文山壮族苗族自治州','云南省'),(256,'西双版纳傣族自治州','云南省'),(257,'大理白族自治州','云南省'),(258,'德宏傣族景颇族自治州','云南省'),(259,'怒江傈僳族自治州','云南省'),(260,'迪庆藏族自治州','云南省'),(261,'西安','陕西省'),(262,'铜川','陕西省'),(263,'宝鸡','陕西省'),(264,'咸阳','陕西省'),(265,'渭南','陕西省'),(266,'延安','陕西省'),(267,'汉中','陕西省'),(268,'榆林','陕西省'),(269,'安康','陕西省'),(270,'商洛','陕西省'),(271,'兰州','甘肃省'),(272,'嘉峪关','甘肃省'),(273,'金昌','甘肃省'),(274,'白银','甘肃省'),(275,'天水','甘肃省'),(276,'武威','甘肃省'),(277,'张掖','甘肃省'),(278,'平凉','甘肃省'),(279,'酒泉','甘肃省'),(280,'庆阳','甘肃省'),(281,'定西','甘肃省'),(282,'陇南','甘肃省'),(283,'临夏回族自治州','甘肃省'),(284,'甘南藏族自治州','甘肃省'),(285,'西宁','青海省'),(286,'海东','青海省'),(287,'海北藏族自治州','青海省'),(288,'黄南藏族自治州','青海省'),(289,'海南藏族自治州','青海省'),(290,'果洛藏族自治州','青海省'),(291,'玉树藏族自治州','青海省'),(292,'海西蒙古族藏族自治州','青海省'),(293,'台北','台湾省'),(294,'高雄','台湾省'),(295,'基隆','台湾省'),(296,'台中','台湾省'),(297,'台南','台湾省'),(298,'新竹','台湾省'),(299,'嘉义','台湾省'),(300,'新北','台湾省'),(301,'宜兰','台湾省'),(302,'桃园','台湾省'),(303,'苗栗','台湾省'),(304,'彰化','台湾省'),(305,'南投','台湾省'),(306,'云林','台湾省'),(307,'屏东','台湾省'),(308,'台东','台湾省'),(309,'花莲','台湾省'),(310,'澎湖','台湾省'),(311,'呼和浩特','内蒙古自治区'),(312,'包头','内蒙古自治区'),(313,'乌海','内蒙古自治区'),(314,'赤峰','内蒙古自治区'),(315,'通辽','内蒙古自治区'),(316,'鄂尔多斯','内蒙古自治区'),(317,'呼伦贝尔','内蒙古自治区'),(318,'巴彦淖尔','内蒙古自治区'),(319,'乌兰察布','内蒙古自治区'),(320,'兴安盟','内蒙古自治区'),(321,'锡林郭勒盟','内蒙古自治区'),(322,'阿拉善盟','内蒙古自治区'),(323,'南宁','广西壮族自治区'),(324,'柳州','广西壮族自治区'),(325,'桂林','广西壮族自治区'),(326,'梧州','广西壮族自治区'),(327,'北海','广西壮族自治区'),(328,'防城港','广西壮族自治区'),(329,'钦州','广西壮族自治区'),(330,'贵港','广西壮族自治区'),(331,'玉林','广西壮族自治区'),(332,'百色','广西壮族自治区'),(333,'贺州','广西壮族自治区'),(334,'河池','广西壮族自治区'),(335,'来宾','广西壮族自治区'),(336,'崇左','广西壮族自治区'),(337,'拉萨','西藏自治区'),(338,'日喀则','西藏自治区'),(339,'昌都','西藏自治区'),(340,'林芝','西藏自治区'),(341,'山南','西藏自治区'),(342,'那曲地区','西藏自治区'),(343,'阿里地区','西藏自治区'),(344,'银川','宁夏回族自治区'),(345,'石嘴山','宁夏回族自治区'),(346,'吴忠','宁夏回族自治区'),(347,'固原','宁夏回族自治区'),(348,'中卫','宁夏回族自治区'),(349,'乌鲁木齐','新疆维吾尔自治区'),(350,'克拉玛依','新疆维吾尔自治区'),(351,'吐鲁番','新疆维吾尔自治区'),(352,'哈密','新疆维吾尔自治区'),(353,'昌吉回族自治州','新疆维吾尔自治区'),(354,'博尔塔拉蒙古自治州','新疆维吾尔自治区'),(355,'巴音郭楞蒙古自治州','新疆维吾尔自治区'),(356,'阿克苏地区','新疆维吾尔自治区'),(357,'克孜勒苏柯尔克孜自治州','新疆维吾尔自治区'),(358,'喀什地区','新疆维吾尔自治区'),(359,'和田地区','新疆维吾尔自治区'),(360,'伊犁哈萨克自治州','新疆维吾尔自治区'),(361,'塔城地区','新疆维吾尔自治区'),(362,'阿勒泰地区','新疆维吾尔自治区'),(363,'自治区直辖县级行政区划','新疆维吾尔自治区'),(364,'北京','北京市'),(365,'天津','天津市'),(366,'上海','上海市'),(367,'重庆','重庆市'),(368,'香港','香港特别行政区'),(369,'澳门','澳门特别行政区');
/*!40000 ALTER TABLE `location` ENABLE KEYS */;
UNLOCK TABLES;
/*!40103 SET TIME_ZONE=@OLD_TIME_ZONE */;

/*!40101 SET SQL_MODE=@OLD_SQL_MODE */;
/*!40014 SET FOREIGN_KEY_CHECKS=@OLD_FOREIGN_KEY_CHECKS */;
/*!40014 SET UNIQUE_CHECKS=@OLD_UNIQUE_CHECKS */;
/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
/*!40111 SET SQL_NOTES=@OLD_SQL_NOTES */;

-- Dump completed on 2024-04-23 15:35:50
